# YOLO11m with CBAM attention
# Model: 640x640, depth=0.67, width=0.75 (mid-size)

nc: 79  # number of classes

scales:
  m: [0.67, 0.75, 1024]


# -------------------------------------------------
# Backbone
# -------------------------------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0
  - [-1, 1, Conv, [128, 3, 2]]         # 1
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, CBAM, []]                  # CBAM #1

  - [-1, 1, Conv, [256, 3, 2]]         # 4
  - [-1, 6, C2f, [256, True]]          # 5
  - [-1, 1, CBAM, []]                  # CBAM #2

  - [-1, 1, Conv, [512, 3, 2]]         # 7
  - [-1, 6, C2f, [512, True]]          # 8
  - [-1, 1, CBAM, []]                  # CBAM #3

  - [-1, 1, SPPF, [512, 5]]             # 10

# -------------------------------------------------
# Head (neck + detect combined)
# -------------------------------------------------
head:
  - [-1, 1, Conv, [256, 1, 1]]          # 11
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 12
  - [[-1, 5], 1, Concat, [1]]            # 13
  - [-1, 3, C2f, [256]]                  # 14
  - [-1, 1, CBAM, []]                    # CBAM #4

  - [-1, 1, Conv, [128, 1, 1]]           # 16
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 17
  - [[-1, 2], 1, Concat, [1]]             # 18
  - [-1, 3, C2f, [128]]                  # 19
  - [-1, 1, CBAM, []]                    # CBAM #5

  - [-1, 1, Conv, [128, 3, 2]]           # 21
  - [[-1, 14], 1, Concat, [1]]            # 22
  - [-1, 3, C2f, [256]]                  # 23
  - [-1, 1, CBAM, []]                    # CBAM #6

  - [-1, 1, Conv, [256, 3, 2]]           # 25
  - [[-1, 8], 1, Concat, [1]]             # 26
  - [-1, 3, C2f, [512]]                  # 27

  - [[19, 23, 27], 1, Detect, [nc]]       # P3, P4, P5
